import React from 'react';
import { Link } from 'wouter';

import { TextSection } from '../components/TextSection.js';

export const About: React.FC = () => {
  return (
    <TextSection>
      <h2>ברוכים הבאים</h2>
      <p>ברוכים הבאים לאתר copy-paste.cc!.</p>
      <p>
        אתר זה מאפשר להעביר קבצים בין כל סוגי המכשירים באופן חופשי ללא תלות במערכת ההפעלה או המותג של המכשיר שממנו נכנסתם לאתר.<br/>
האתר נוצר כדי לחסוך העברות קבצים דרך המייל או אפליקציות חברתיות שלפעמים משנות את הקבצים ומורידות איכות בתמונות. הקבצים שיועברו באמצעות אתר זה, ישארו באיכותם ובגודלם המקוריים ויועברו במהירות האפשרית הגבוהה ביותר.
      </p>
	  <p>
         אם שני המכשירים שמעבירים קבצים בניהם נמצאים על אותה רשת מקומית, הקבצים יעברו באופן ישיר בין המכשירים ולא יעברו דרך השרת.<br/>
		אם החיבור לאתר נעשה באמצעות רשתות שונות, הקבצים יועברו דרך השרת אך לא ישמרו בו בשום שלב.<br/>
העברת הקבצים אפשרית רק בזמן ששני הצדדים נמצאים באתר בו זמנית והקבצים יועברו ישירות בניהם (גם אם דרך השרת). ברגע שאחד הצדדים עוזב את האתר, החיבור נקטע ולא ניתן להעביר או לשמור קבצים להעברה מאוחרת יותר.
        </p>
		<p>האתר תומך במכשירים ובמערכות ההפעלה הבאות: IPhone, Android, Mac, Windows, Linux, Chrombook</p>
	  
      <p>ככה תעבירו קבצים:</p>
      <ol>
        <li>יש לפתוח את האתר הזה במכשיר הראשון (אתם כבר פה!)</li>
        <li>
         ניתן לסרוק את ה-QR code באמצעות המכשיר השני, או לשלוח לו את הכתובת היחודית באמצעות כפתור "הזמנה".
        </li>
        <li>
          ניתן לגרור ולשחרר קבצים אל קוביה אחרת שאיננה "את/ה", או ללחוץ על הקוביה כדי לבחור קבצים מהמכשיר.
        </li>
        <li>יש לאשר את ההעברה במכשיר שאליו נשלחים הקבצים.</li>
      </ol>
      
      <p>
        שימוש באתר משמעותו אישור של{' '}
          <Link to="/privacy">מדיניות הפרטיות</Link> וקבלת{' '}
          <Link to="/tos">תנאי השירות</Link>. 
      </p>
	  
    </TextSection>
  );
};

export default About;
