import React from 'react';

import { TextSection } from '../components/TextSection.js';

export const ToS: React.FC = () => {
  return (
    <TextSection>
      <h2>תנאי שימוש</h2>
      <p>
        <strong>
          בעצם שימוש באתר זה (שימוש משמעו, אך לא רק, אישור הודעת "ברוכים הבאים", העברת קבצים, חיבור לשרת TURN המשמש אתר זה, חיבור לשרת WebSocket המסופק באתר זה, ו/או התחברויות מרובות ע"י משתמש הקצה) את/ה מאשר/ת את תנאי השימוש.
        </strong>
      </p>
      <p>
        האתר והשירות מסופקים "כמות שהם" וכל אחריות מפורשת או משתמעת, לרבות אך לא רק, בכל שימוש באתר הינה באחריות המשתמש בלבד. בשום מקרה לא יהיה בעל האתר והשירות אחראי לכל נזק ישיר, עקיף, מקרי, מיוחד או תוצאתי משימוש באתר זה. ככל שיגרם נזק כלשהו במישרין או בעקיפין משימוש באתר זה לרבות אך לא רק, רשלנות הנובעת משימוש באתר זה או מליקוי שהתגלה באתר גם אם נודע לבעל האתר על אפשרות שכזו, לא ישא בעל האתר בשום אחריות והאחריות הינה על המשתמש בלבד.							
      </p>
      <ol>
        <li>
          בעצם הכניסה לאתר והשימוש בו, הינך מאשרת/ת את תנאי השימוש.
        </li>
        <li>
         תנאי השימוש נתונים לשינוי ללא הודעה מוקדמת. בעצם המשך השימוש באתר הינך מאשר/ת את תנאי השימוש.	
        </li>
        <li>
         הכניסה לאתר זה עלולה להחסם ללא הודעה מוקדמת מכל סיבה (כולל ללא מתן כל סיבה ע"י בעל האתר).
        </li>
        <li>
          מטרת האתר היא לספק את האפשרות להעביר קבצים קטנים (למעט קבצים שאינם מורשים להעברה ע"י תנאי השימוש) בין מכשירים ברשת מקומית או בין מכשירים ברשתות שונות באמצעות שרת TURN.
        </li>
        <li>
          פעולות האסורות באתר זה ועלולות לגרום לחסימת גישה לאתר ללא הודעה מוקדמת כוללות, אך לא מוגבלות ל:
          <ul>
            <li>
              שימוש באתר לביצוע פעולות לא חוקיות, במיוחד אלו הנחשבות כלא חוקיות באיחוד האירופי, ארה"ב וישראל,					 
            </li>
            <li>
              שימוש באתר לביצוע פעולות האסורות ע"פ  החוק הבינלאומי,
            </li>
            <li>שימוש באתר לביצוע הונאה,</li>
            <li>
              שימוש באתר להעברת קבצים המוגנים בזכויות יוצרים או קבצים המכילים תוכן פורנוגרפי או תוכן אסור לשימוש ע"פ החוק,  
            </li>
            <li>שימוש באתר להעברת כמויות מופרזות של נתונים,</li>
            <li>שימוש באתר להפצת נוזקה,</li>
            <li>
              uשימוש בשירות ה-TURN של האתר לפעולות שהשרת לא נועד להן במקור,
            </li>
            <li>
              נסיון פריצה לאתר או שימוש לרעה בפרצות שנמצאו באתר.
            </li>
          </ul>
        </li>
        <li>
          האתר לא שומר שום מידע פרטני על המשתמש בשרתיו. חיבורי WebRTC מוצפנים מקצה לקצה ע"פ המפרט הטכני של WebRTC ולא ינקטו שום פעולות ע"י האתר כדי לפענח את התוכן (במקרה שהנתונים מועברים דרך שרת TURN של האתר). מטא-נתונים הקשורים להעברת הקבצים (כגון שם קובץ, גודל וסוג הקובץ) אינם נשמרים באחסון האתר ונמצאים באופן זמני בזכרון הזמני של השרת בזמן העברת הקבצים עצמם, המידע נעלם מזכרון השרת מיד בסיום העברת הקובץ.
        </li>
        <li>
          כל חיבור חדש מייצר מזהה יחודי חדש שיושמד ברגע שהחיבור לאתר יגמר, והמידע לא ישמש למעקב אחריך.
        </li>
        <li>
          השימוש באתר ניתן בחינם ולא ניתנת שום אחריות. מפעיל האתר אינו אחראי לכל נזק שיגרם עקב השימוש בשירות.
        </li>
        <li>
          למפעיל האתר יש את הזכות לסגור את האתר מכל סיבה (גם ללא סיבה) באופן זמני או קבוע. בעל האתר לא מחוייב להמשיך ולהפעיל את האתר בשום שלב.
        </li>
      </ol>
    </TextSection>
  );
};

export default ToS;
